In [2]:
import pandas as pd

In [5]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
a=pd.Series([1,2,3,4,5])

In [8]:
type(a.dtype)

numpy.dtype[int64]

In [12]:
b={"day1": 420, "day2": 380, "day3": 390}

c=pd.Series(b)
print(c)

day1    420
day2    380
day3    390
dtype: int64

In [15]:
marks=[34,56,43,65,76,87,34,34,54,65]
name=['sohan','ram','mohan','prashant','rohit','abhishek','gabbar','himanshu','ankit','raushan']

classMarks=pd.Series(data=marks,index=name)
print(classMarks)

sohan       34
ram         56
mohan       43
prashant    65
rohit       76
abhishek    87
gabbar      34
himanshu    34
ankit       54
raushan     65
dtype: int64

In [32]:
data=pd.read_csv('./data/random.csv',header=None).squeeze('columns')
print(data)

    0     1     2     3    4      5      6      7      8     9   ...    20  \
0  279  8187  8866  7618  770  55700  32155  21777  38136  1435  ...  3114

     21   22    23    24    25     26   27    28    29
0  2895  223  9323  5482  1140  14850  477  2396  2438

[1 rows x 30 columns]

In [38]:
survey=pd.read_csv('./data/annual-survey.csv',usecols=['value').squeeze('columns')
print(survey)

0          46134
1              0
2            279
3           8187
4           8866
          ...
17023     757504
17024     654404
17025      85116
17026    2512677
17027     591351
Name: value, Length: 17028, dtype: object

In [39]:
data.head()

,0,1,2,3,4,5,6,7,8,9,...,20,21,22,23,24,25,26,27,28,29
0,279,8187,8866,7618,770,55700,32155,21777,38136,1435,...,3114,2895,223,9323,5482,1140,14850,477,2396,2438

In [40]:
survey.head()

0    46134
1        0
2      279
3     8187
4     8866
Name: value, dtype: object

In [41]:
survey_data=pd.read_csv('./data/annual-survey.csv')

In [42]:
survey_data.head()

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)

In [44]:
survey_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17028 entries, 0 to 17027
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   year                  17028 non-null  int64
 1   industry_code_ANZSIC  17028 non-null  object
 2   industry_name_ANZSIC  17028 non-null  object
 3   rme_size_grp          17028 non-null  object
 4   variable              17028 non-null  object
 5   value                 17028 non-null  object
 6   unit                  17028 non-null  object
dtypes: int64(1), object(6)
memory usage: 931.3+ KB

In [45]:
survey_data.describe()

               year
count  17028.000000
mean    2016.000000
std        3.162371
min     2011.000000
25%     2013.000000
50%     2016.000000
75%     2019.000000
max     2021.000000